{
  "designSystem": {
    "name": "Minimalist Blue & Dark Theme",
    "description": "A design system emphasizing clean aesthetics, clear hierarchy, and adaptable color themes, suitable for both light and dark modes. Focuses on strong visual contrast and user-friendly typography.",
    "styleGuidelines": {
      "overallAesthetic": "Modern, clean, minimalist, and functional.",
      "cornerRadii": "Consistent rounded corners for UI elements and containers, promoting a softer, friendly feel.",
      "visualHierarchy": "Clear text hierarchy achieved through varying font weights, sizes, and color contrast, guiding user attention.",
      "contrast": "High contrast ratios for text and key interactive elements against backgrounds to ensure readability and accessibility.",
      "spacingPrinciple": "Generous and consistent padding and margins around elements, creating visual breathing room and structured layouts."
    },
    "colorPalette": [
      {
        "role": "Primary Color",
        "name": "Ocean Blue",
        "usage": "Main interactive elements, calls-to-action, branding accents.",
        "value": "hsl(217, 100%, 66%)"
      },
      {
        "role": "Primary Dark Variant",
        "name": "Deep Ocean Blue",
        "usage": "Alternative for primary color, potentially for hover states or active selections in light mode, or a base for primary in dark mode.",
        "value": "hsl(217, 100%, 66%)"
      },
      {
        "role": "Light Background",
        "name": "Pale Sky Background",
        "usage": "Default background for light themes, large content areas, cards.",
        "value": "hsl(214, 95%, 93%)"
      },
      {
        "role": "Dark Background",
        "name": "Midnight Blue Background",
        "usage": "Default background for dark themes, contrasting sections, deeply immersive UI elements.",
        "value": "hsl(227, 40%, 21%)"
      }
    ],
    "typographyGuidelines": {
      "fontFamily": "Sans-serif (e.g., Inter, Roboto, Arial) for clarity and modern appeal.",
      "headingSizes": "Defined scale for headings (H1-H6) with distinct weights to establish content hierarchy.",
      "bodyText": "Readable body text sizes with optimal line height for long-form content.",
      "labelAndCaptionText": "Smaller, legible text for labels, captions, and supplementary information."
    },
    "componentStructure": {
      "containers": {
        "description": "Rectangular elements with consistent rounded corners, containing related content.",
        "shadows": "Subtle box shadows to give depth and separation without being distracting.",
        "padding": "Internal padding to provide space between content and container edges."
      },
      "textBlocks": {
        "description": "Organized text within containers, using variations in font size and weight to indicate importance.",
        "color": "Text colors optimized for contrast against their respective backgrounds (light text on dark, dark text on light)."
      },
      "interactiveElements": {
        "description": "Buttons, links, and other actionable items should utilize the primary color palette for prominence, with clear hover/active states."
      }
    }
  }
}
